Introduction to Python 5199 - Spring, 2021

Vidya Madhavan - vm2621

HW6 - 03/17/2021

In [2]:
import pandas as pd

In [3]:
grades = pd.Series([87, 100, 94])

In [4]:
pd.Series(98.6, range(3))

0    98.6
1    98.6
2    98.6
dtype: float64

In [5]:
pd.Series(98.6, ['grade1', 'grade2', 'grade3'])

grade1    98.6
grade2    98.6
grade3    98.6
dtype: float64

In [6]:
grades = pd.Series([87, 100, 94])
grades

0     87
1    100
2     94
dtype: int64

In [7]:
grades[0]

87

In [8]:
grades.count()

3

In [9]:
grades.mean()

93.66666666666667

In [10]:
grades.min()

87

In [11]:
grades.max()

100

In [12]:
grades.std()

6.506407098647712

In [13]:
grades.describe()
#it will get all your descrptive statistics at once

count      3.000000
mean      93.666667
std        6.506407
min       87.000000
25%       90.500000
50%       94.000000
75%       97.000000
max      100.000000
dtype: float64

In [20]:
grades = pd.Series([87, 100, 94], index=['WallE', 'Eva', 'Sam'])

In [21]:
grades

WallE     87
Eva      100
Sam       94
dtype: int64

In [22]:
grades = pd.Series({'WallE': 87, 'Eva':100, 'Sam': 94})

In [23]:
grades

WallE     87
Eva      100
Sam       94
dtype: int64

In [24]:
grades['Eva']

100

In [25]:
grades.WallE
#our words, incase there are multiple words for each index, need to be attached with underscores

87

In [26]:
grades.dtype

dtype('int64')

In [27]:
grades.values

array([ 87, 100,  94])

In [28]:
hardware = pd.Series(['Hammer', 'Saw', 'Wrench'])

In [29]:
hardware
#We can use string processing methods after using the attribute str in the series - examples given below

0    Hammer
1       Saw
2    Wrench
dtype: object

In [30]:
hardware.str.contains('a')

0     True
1     True
2    False
dtype: bool

In [31]:
hardware.str.upper()

0    HAMMER
1       SAW
2    WRENCH
dtype: object

In [91]:
import pandas as pd

In [92]:
grades_dict = {'WallE': [87, 96, 70], 'Eva': [100, 87, 90],
              'Sam': [94, 77, 90], 'Katie': [100, 81, 82],
              'Bob': [83, 65, 85]}
#curly brackets is to denote a dictionary

In [93]:
grades = pd.DataFrame(grades_dict)
grades

   WallE  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [94]:
grades.index = ['Test1', 'Test2', 'Test3']
grades

       WallE  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [41]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [42]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

In [43]:
grades.loc['Test1']
#We need to use locate = loc or iloc in order to find the rows.
#loc will work only when we have assigned customized indexes

WallE     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [45]:
grades.iloc[1]
#In iloc, we can only use numbers in this which will call upon on the integer indexes which are assigned by default

WallE    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

In [46]:
grades.loc['Test1': 'Test3']

       WallE  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [47]:
grades.iloc[0:2]
#This does not include index 2, it only prints 0 and 1

       WallE  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

In [48]:
grades.loc[['Test1', 'Test3']]

       WallE  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [49]:
grades.iloc[[0, 2]]

       WallE  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [50]:
grades.loc['Test1': 'Test2', ['Eva', 'Katie']]

       Eva  Katie
Test1  100    100
Test2   87     81

In [51]:
grades.iloc[[0,2], 0:3]

       WallE  Eva  Sam
Test1     87  100   94
Test3     70   90   90

In [54]:
grades.loc['Test2': 'Test3', 'Sam': 'Bob']

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [61]:
grades.iloc[[1,2], [2, 3, 4]]

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [53]:
grades.iloc[1:3, 2:5]

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [60]:
grades.loc[['Test2','Test3'], ['Sam', 'Katie', 'Bob']]

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [62]:
grades.at['Test2', 'Eva']

87

In [63]:
grades.iat[2, 0]

70

In [64]:
#This is to avoid or change typos
grades.at['Test2', 'Eva'] = 100
grades.at['Test2', 'Eva']

100

In [65]:
grades.iat[1, 2] = 87

In [66]:
grades.iat[1, 2]

87

In [67]:
grades[grades >= 90]
#In this function, the it shows Nan instead of False

       WallE  Eva   Sam  Katie  Bob
Test1    NaN  100  94.0  100.0  NaN
Test2   96.0  100   NaN    NaN  NaN
Test3    NaN   90  90.0    NaN  NaN

In [68]:
grades[(grades >= 80) & (grades < 90)]

       WallE  Eva   Sam  Katie   Bob
Test1   87.0  NaN   NaN    NaN  83.0
Test2    NaN  NaN  87.0   81.0   NaN
Test3    NaN  NaN   NaN   82.0  85.0

In [69]:
grades.describe()

           WallE         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   96.666667  90.333333   87.666667  77.666667
std    13.203535    5.773503   3.511885   10.692677  11.015141
min    70.000000   90.000000  87.000000   81.000000  65.000000
25%    78.500000   95.000000  88.500000   81.500000  74.000000
50%    87.000000  100.000000  90.000000   82.000000  83.000000
75%    91.500000  100.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [70]:
pd.set_option('precision', 2)

In [72]:
grades.describe()

       WallE     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   96.67  90.33   87.67  77.67
std    13.20    5.77   3.51   10.69  11.02
min    70.00   90.00  87.00   81.00  65.00
25%    78.50   95.00  88.50   81.50  74.00
50%    87.00  100.00  90.00   82.00  83.00
75%    91.50  100.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [73]:
grades.T

       Test1  Test2  Test3
WallE     87     96     70
Eva      100    100     90
Sam       94     87     90
Katie    100     81     82
Bob       83     65     85

In [74]:
grades.T.describe()

        Test1   Test2  Test3
count    5.00    5.00   5.00
mean    92.80   85.80  83.40
std      7.66   13.81   8.23
min     83.00   65.00  70.00
25%     87.00   81.00  82.00
50%     94.00   87.00  85.00
75%    100.00   96.00  90.00
max    100.00  100.00  90.00

In [75]:
grades.T.mean()

Test1    92.8
Test2    85.8
Test3    83.4
dtype: float64

In [76]:
grades2 = grades.sort_index(ascending=False)
#by default it sorts in ascending order, hence you have to assign False in order to sort in descending order
grades2

       WallE  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96  100   87     81   65
Test1     87  100   94    100   83

In [77]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  WallE
Test1   83  100    100   94     87
Test2   65  100     81   87     96
Test3   85   90     82   90     70

In [78]:
grades.sort_values(by='Test1', axis=1, ascending=False)

       Eva  Katie  Sam  WallE  Bob
Test1  100    100   94     87   83
Test2  100     81   87     96   65
Test3   90     82   90     70   85

In [95]:
grades.T.sort_values(by='Test1', ascending=False)

       Test1  Test2  Test3
Eva      100     87     90
Katie    100     81     82
Sam       94     77     90
WallE     87     96     70
Bob       83     65     85

In [96]:
grades.sort_values(by='Eva', ascending=False)

       WallE  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85
Test2     96   87   77     81   65

In [97]:
grades.sort_values(by='Eva', ascending=False, inplace=True)
grades

       WallE  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85
Test2     96   87   77     81   65

In [43]:
import pandas as pd

In [44]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/carData/TitanicSurvival.csv')

In [45]:
titanic.head()
#To look at only the first 5 observation, mostly done to make sure it is loaded correctly

                        Unnamed: 0 survived     sex      age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2     Allison, Miss. Helen Loraine       no  female   2.0000            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st

In [46]:
titanic.head(10)

                        Unnamed: 0 survived     sex      age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2     Allison, Miss. Helen Loraine       no  female   2.0000            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st
5              Anderson, Mr. Harry      yes    male  48.0000            1st
6  Andrews, Miss. Kornelia Theodos      yes  female  63.0000            1st
7           Andrews, Mr. Thomas Jr       no    male  39.0000            1st
8  Appleton, Mrs. Edward Dale (Cha      yes  female  53.0000            1st
9          Artagaveytia, Mr. Ramon       no    male  71.0000            1st

In [47]:
titanic.tail()
#This is to look at the last 5 observations

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [48]:
titanic.shape

(1309, 5)

In [49]:
titanic.columns = ['Name', 'survived', 'sex', 'age', 'class']
#to rename all the columns

In [50]:
titanic.head()

                              Name survived     sex      age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000   1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167   1st
2     Allison, Miss. Helen Loraine       no  female   2.0000   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000   1st

In [51]:
titanic.rename(columns={'Name': 'name'}, inplace = True)
titanic.head()

                              name survived     sex      age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000   1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167   1st
2     Allison, Miss. Helen Loraine       no  female   2.0000   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000   1st

In [52]:
titanic.dtypes

name         object
survived     object
sex          object
age         float64
class        object
dtype: object

In [53]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      1309 non-null   object
 1   survived  1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   class     1309 non-null   object
dtypes: float64(1), object(4)
memory usage: 51.3+ KB

In [54]:
titanic.isnull()

       name  survived    sex    age  class
0     False     False  False  False  False
1     False     False  False  False  False
2     False     False  False  False  False
3     False     False  False  False  False
4     False     False  False  False  False
...     ...       ...    ...    ...    ...
1304  False     False  False  False  False
1305  False     False  False   True  False
1306  False     False  False  False  False
1307  False     False  False  False  False
1308  False     False  False  False  False

[1309 rows x 5 columns]

In [55]:
titanic.isnull().sum()

name          0
survived      0
sex           0
age         263
class         0
dtype: int64

In [56]:
titanic[titanic.isnull().any(axis=1)].head()
#This again gives only the top 5. To see them all avoid using the head command

                               name survived     sex  age class
15              Baumann, Mr. John D       no    male  NaN   1st
37   Bradley, Mr. George (George Ar      yes    male  NaN   1st
40        Brewe, Dr. Arthur Jackson       no    male  NaN   1st
46            Cairns, Mr. Alexander       no    male  NaN   1st
59  Cassebeer, Mrs. Henry Arthur Jr      yes  female  NaN   1st

In [57]:
titanic['age'].fillna(-1, inplace=True)
titanic.isnull().sum()

name        0
survived    0
sex         0
age         0
class       0
dtype: int64

In [58]:
print(titanic.shape)
titanic.isnull().sum()

(1309, 5)

name        0
survived    0
sex         0
age         0
class       0
dtype: int64

In [59]:
titanic.dropna(inplace=True)
print(titanic.shape)
titanic.isnull().sum()
#This is to drop all the NA observations

(1309, 5)

name        0
survived    0
sex         0
age         0
class       0
dtype: int64

In [60]:
titanic.describe()
#This works only with numeric columns. So for the titanic DF this works only with age

               age
count  1309.000000
mean     23.676598
std      17.866189
min      -1.000000
25%       7.000000
50%      24.000000
75%      35.000000
max      80.000000

In [61]:
titanic['age'].describe()

count    1309.000000
mean       23.676598
std        17.866189
min        -1.000000
25%         7.000000
50%        24.000000
75%        35.000000
max        80.000000
Name: age, dtype: float64

In [62]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [4]:
import pandas as pd

In [5]:
df = pd.read_excel(r'/Users/vidyamadhavan/Downloads/Employee_Attrition_Dataset_excel.xlsx')

In [6]:
df.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,...,NumCompaniesWorked,OverTime,PerformanceRating,RelationshipSatisfaction,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4,...,8,Yes,3,1,8,0,6,4,0,5
1,49,No,Travel_Frequently,Research & Development,1,3,Male,61,2,2,...,1,No,4,4,10,3,10,7,1,7
2,37,Yes,Travel_Rarely,Research & Development,2,4,Male,92,2,3,...,6,Yes,3,2,7,3,0,0,0,0
3,33,No,Travel_Frequently,Research & Development,4,4,Female,56,3,3,...,1,Yes,3,3,8,3,8,7,3,0
4,27,No,Travel_Rarely,Research & Development,1,1,Male,40,3,2,...,9,No,3,4,6,3,2,2,2,2

In [7]:
df.shape

(1470, 22)

In [8]:
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'Department', 'Education',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobSatisfaction', 'MaritalStatus', 'MonthlyIncome',
       'NumCompaniesWorked', 'OverTime', 'PerformanceRating',
       'RelationshipSatisfaction', 'TotalWorkingYears',
       'TrainingTimesLastYear', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YearsWithCurrManager'],
      dtype='object')

In [1]:
#Do slide 46,47,48, 49, 50, 51, till the end of the presentation. LOL

In [9]:
df1 = df[['Age', 'Attrition', 'BusinessTravel', 'Department', 'Education',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobSatisfaction']]
df1.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
1,49,No,Travel_Frequently,Research & Development,1,3,Male,61,2,2
2,37,Yes,Travel_Rarely,Research & Development,2,4,Male,92,2,3
3,33,No,Travel_Frequently,Research & Development,4,4,Female,56,3,3
4,27,No,Travel_Rarely,Research & Development,1,1,Male,40,3,2

In [10]:
df1 = df.drop(columns= ['MaritalStatus', 'MonthlyIncome',
       'NumCompaniesWorked', 'OverTime', 'PerformanceRating',
       'RelationshipSatisfaction', 'TotalWorkingYears',
       'TrainingTimesLastYear', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YearsWithCurrManager'])
df1.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
1,49,No,Travel_Frequently,Research & Development,1,3,Male,61,2,2
2,37,Yes,Travel_Rarely,Research & Development,2,4,Male,92,2,3
3,33,No,Travel_Frequently,Research & Development,4,4,Female,56,3,3
4,27,No,Travel_Rarely,Research & Development,1,1,Male,40,3,2

In [11]:
df1 = df[['Age', 'Attrition', 'BusinessTravel', 'Department', 'Education',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobSatisfaction']]
df1.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
1,49,No,Travel_Frequently,Research & Development,1,3,Male,61,2,2
2,37,Yes,Travel_Rarely,Research & Development,2,4,Male,92,2,3
3,33,No,Travel_Frequently,Research & Development,4,4,Female,56,3,3
4,27,No,Travel_Rarely,Research & Development,1,1,Male,40,3,2

In [12]:
df1['BusinessTravel'].unique()

array(['Travel_Rarely', 'Travel_Frequently', 'Non-Travel'], dtype=object)

In [13]:
df1['Department'].unique()

array(['Sales', 'Research & Development', 'Human Resources'], dtype=object)

In [14]:
df1['Department'].nunique()

3

In [15]:
df1['Department'].value_counts()

Research & Development    961
Sales                     446
Human Resources            63
Name: Department, dtype: int64

In [16]:
df1['Department'].value_counts(normalize=True)

Research & Development    0.653741
Sales                     0.303401
Human Resources           0.042857
Name: Department, dtype: float64

In [17]:
df2 = df1[df1['Department']=='Sales']
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
18,53,No,Travel_Rarely,Sales,4,1,Female,78,2,4
21,36,Yes,Travel_Rarely,Sales,4,3,Male,82,2,1
27,42,No,Travel_Rarely,Sales,4,3,Male,48,3,2
29,46,No,Travel_Rarely,Sales,4,2,Female,83,3,1

In [18]:
df2 = df1[df1['Department']=='Sales'].reset_index(drop=True)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
1,53,No,Travel_Rarely,Sales,4,1,Female,78,2,4
2,36,Yes,Travel_Rarely,Sales,4,3,Male,82,2,1
3,42,No,Travel_Rarely,Sales,4,3,Male,48,3,2
4,46,No,Travel_Rarely,Sales,4,2,Female,83,3,1

In [20]:
df_sort = df.sort_values(by = 'Age')
df_sort.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,...,NumCompaniesWorked,OverTime,PerformanceRating,RelationshipSatisfaction,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
1311,18,No,Non-Travel,Research & Development,3,2,Female,33,3,3,...,1,No,3,3,0,4,0,0,0,0
457,18,Yes,Travel_Frequently,Sales,3,2,Male,69,3,2,...,1,Yes,3,4,0,3,0,0,0,0
972,18,No,Non-Travel,Research & Development,3,4,Female,97,3,4,...,1,No,3,3,0,5,0,0,0,0
301,18,No,Travel_Rarely,Sales,3,4,Female,69,2,3,...,1,No,3,1,0,2,0,0,0,0
296,18,Yes,Travel_Rarely,Research & Development,3,3,Male,54,3,3,...,1,No,3,3,0,2,0,0,0,0

In [21]:
d= {'Female': 0, 'Male':1}
df2['Gender_dummy']= df2['Gender'].map(d)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4,0
1,53,No,Travel_Rarely,Sales,4,1,Female,78,2,4,0
2,36,Yes,Travel_Rarely,Sales,4,3,Male,82,2,1,1
3,42,No,Travel_Rarely,Sales,4,3,Male,48,3,2,1
4,46,No,Travel_Rarely,Sales,4,2,Female,83,3,1,0

In [22]:
df2['Department'].replace({'Sales': 'Sales Department'}, inplace = True)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy
0,41,Yes,Travel_Rarely,Sales Department,2,2,Female,94,3,4,0
1,53,No,Travel_Rarely,Sales Department,4,1,Female,78,2,4,0
2,36,Yes,Travel_Rarely,Sales Department,4,3,Male,82,2,1,1
3,42,No,Travel_Rarely,Sales Department,4,3,Male,48,3,2,1
4,46,No,Travel_Rarely,Sales Department,4,2,Female,83,3,1,0

In [25]:
df2['Overall_Satisfaction'] = df2['EnvironmentSatisfaction'] + df2['JobSatisfaction']
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy,Overall_Satisfaction
0,41,Yes,Travel_Rarely,Sales Department,2,2,Female,94,3,4,0,6
1,53,No,Travel_Rarely,Sales Department,4,1,Female,78,2,4,0,5
2,36,Yes,Travel_Rarely,Sales Department,4,3,Male,82,2,1,1,4
3,42,No,Travel_Rarely,Sales Department,4,3,Male,48,3,2,1,5
4,46,No,Travel_Rarely,Sales Department,4,2,Female,83,3,1,0,3

In [26]:
lambda x: x+3

In [27]:
def add3(x):
    return x + 3

In [28]:
df2['Age']=df2['Age'].apply(lambda x: x + 3)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy,Overall_Satisfaction
0,44,Yes,Travel_Rarely,Sales Department,2,2,Female,94,3,4,0,6
1,56,No,Travel_Rarely,Sales Department,4,1,Female,78,2,4,0,5
2,39,Yes,Travel_Rarely,Sales Department,4,3,Male,82,2,1,1,4
3,45,No,Travel_Rarely,Sales Department,4,3,Male,48,3,2,1,5
4,49,No,Travel_Rarely,Sales Department,4,2,Female,83,3,1,0,3

In [29]:
df2['Age']=df2['Age'].apply(lambda x: x + 3 if x >= 45 else x + 5 )
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy,Overall_Satisfaction
0,49,Yes,Travel_Rarely,Sales Department,2,2,Female,94,3,4,0,6
1,59,No,Travel_Rarely,Sales Department,4,1,Female,78,2,4,0,5
2,44,Yes,Travel_Rarely,Sales Department,4,3,Male,82,2,1,1,4
3,48,No,Travel_Rarely,Sales Department,4,3,Male,48,3,2,1,5
4,52,No,Travel_Rarely,Sales Department,4,2,Female,83,3,1,0,3

In [30]:
df_gb = df[['Department', 'EnvironmentSatisfaction', 'HourlyRate', 'JobSatisfaction']].groupby(by=['Department']).mean()
df_gb

                        EnvironmentSatisfaction  HourlyRate  JobSatisfaction
Department
Human Resources                        2.682540   64.301587         2.603175
Research & Development                 2.744017   66.167534         2.726327
Sales                                  2.679372   65.520179         2.751121

In [32]:
df_1 = pd.DataFrame({
    "id": [1, 2, 3, 4],
    "Gender": ["F", "F", "M", "F"],
    "Income": [345, 676, 963, 898]}, index=[0, 1, 2, 3])

df_1

   id Gender  Income
0   1      F     345
1   2      F     676
2   3      M     963
3   4      F     898

In [33]:
df_2 = pd.DataFrame({
    "id": [5, 6, 7],
    "Gender": ["M", "F", "M"],
    "Income": [879, 1012, 556]}, index=[0, 1, 2])

df_2

   id Gender  Income
0   5      M     879
1   6      F    1012
2   7      M     556

In [35]:
df_12=pd.concat([df_1, df_2])
df_12

   id Gender  Income
0   1      F     345
1   2      F     676
2   3      M     963
3   4      F     898
0   5      M     879
1   6      F    1012
2   7      M     556

In [36]:
df_1 = pd.DataFrame({
    "id": [1, 2, 3, 4],
    "Gender": ["F", "F", "M", "F"],
    "Income": [345, 676, 963, 898]}, index=[0, 1, 2, 3])

df_1

   id Gender  Income
0   1      F     345
1   2      F     676
2   3      M     963
3   4      F     898

In [37]:
df_3 = pd.DataFrame({
    "id" : [1, 2],
    "Age" : [23, 45],
    "Job" : ["Sales", 'HR']}, index=[0, 1])
df_3

   id  Age    Job
0   1   23  Sales
1   2   45     HR

In [38]:
df_left=df_1.merge(df_3, how = 'left', on =['id'])
df_left

   id Gender  Income   Age    Job
0   1      F     345  23.0  Sales
1   2      F     676  45.0     HR
2   3      M     963   NaN    NaN
3   4      F     898   NaN    NaN

In [39]:
df_inner=df_1.merge(df_3, how = 'inner', on =['id'])
df_inner

   id Gender  Income  Age    Job
0   1      F     345   23  Sales
1   2      F     676   45     HR

In [64]:
titanic.to_csv('titanic_clean.csv', index=False)
df.to_excel('df_clean.xlsx', index=False)

In [ ]:
# END